tutorials4NF/validations4NF/forcedConvection_ZeinaliHeris/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.00106383;

X 940;
nq 10;
nt 10;
nl 100;

vertices        
(
//internal square
    (0 -1 -1) //0
    ($X -1 -1) //1
    ($X -1  1) //2
    (0 -1  1) //3
    (0  1 -1) //4
    ($X  1 -1) //5
    ($X  1  1) //6
    (0  1  1) //7
//Going clockwise with sections
//North section
    (0  2  2) //8
    (0 -2  2) //9
    ($X  2  2) //10
    ($X -2  2) //11
//East section
    (0  2 -2) //12
    ($X  2 -2) //13
//South section
    (0 -2 -2) //14
    ($X -2 -2) //15
);

edges           
(
//North section
   arc  8  9 (0  0     2.82)
   arc 10 11 ($X  0     2.82)
//East section
   arc  8 12 (0  2.82  0)
   arc 10 13 ($X  2.82  0)
//South section
   arc 12 14 (0  0 -2.82 )
   arc 13 15 ($X  0 -2.82 )
//West section
   arc 14  9 (0  -2.82 0)
   arc 15 11 ($X  -2.82 0)
);

blocks
(
//Centre
    hex (4 5 6 7 0 1 2 3) ($nl $nq $nq) simpleGrading (1 1 1)
//East section
    hex (8 10 11 9 7 6 2 3) ($nl $nq $nt) simpleGrading (1 1 8)
//East section
    hex (12 13 10 8 4 5 6 7) ($nl $nq $nt) simpleGrading (1 1 8)
//South section
    hex (14 15 13 12 0 1 5 4) ($nl $nq $nt) simpleGrading (1 1 8)
//West section
    hex (9 11 15 14 3 2 1 0) ($nl $nq $nt) simpleGrading (1 1 8)
);

patches         
(
    wall tube
    (
        (9 11 10 8)
        (8 10 13 12)
        (12 14 15 13)
        (14 9 11 15)
    )

    patch inlet
    (
        (9  3 7  8)
        (7  4 12  8)
        (0 14 12 4)
        (0 14 9 3)
        (0 4 7 3)
    )

    patch outlet
    (
        (11 2 6 10)
        (6  5 13 10)
        (1 5 13 15)
        (1 15 11 2)
        (1 2 6 5)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
